# 杂七杂八的测试数据

import re
import urllib.request
import os
from pyquery import PyQuery as pq
from lxml import etree
import mongodb

a=r'href="/(\d+)/info'
print(a)
idpattern = re.compile(a)

data = [
    {'id': 11010010001, '姓名':'张三','性别':'男','专业':'通信工程','班级':'1101001'},
    {'id': 11010010002, '姓名':'李四','性别':'男','专业':'通信工程','班级':'1101001'},
    {'id': 11010010003, '姓名': '王鹏', '性别': '男', '专业': '通信工程', '班级': '1101001'},
    {'id': 11010020001, '姓名': '朱里', '性别': '男', '专业': '通信工程', '班级': '1101002'},
    {'id': 11010020002, '姓名': '张苏', '性别': '男', '专业': '通信工程', '班级': '1101002'},
    {'id': 11010020003, '姓名': '马励武', '性别': '男', '专业': '通信工程', '班级': '1101002'},
    {'id': 11010020004, '姓名': '何先勇', '性别': '男', '专业': '通信工程', '班级': '1101002'},
    {'id': 11010030001, '姓名': '李阳', '性别': '男', '专业': '通信工程', '班级': '1101003'},
    {'id': 11010030002, '姓名': '李梦婷', '性别': '女', '专业': '通信工程', '班级': '1101003'},
    {'id': 11010030003, '姓名': '张艺萌', '性别': '女', '专业': '通信工程', '班级': '1101003'},
    {'id': 11020010001, '姓名': '马艺馨', '性别': '女', '专业': '电子工程', '班级': '1102001'},
    {'id': 11020010002, '姓名': '吴庄', '性别': '男', '专业': '电子工程', '班级': '1102001'},
    {'id': 11020010003, '姓名': '杨璐', '性别': '女', '专业': '电子工程', '班级': '1102001'},
    {'id': 11020020001, '姓名': '刘三丹', '性别': '女', '专业': '电子工程', '班级': '1102002'},
    {'id': 11020020002, '姓名': '李欣迪', '性别': '男', '专业': '电子工程', '班级': '1102002'},
    {'id': 11020020003, '姓名': '伍兆斌', '性别': '男', '专业': '电子工程', '班级': '1102002'},
    {'id': 11020030001, '姓名': '伍一雨', '性别': '女', '专业': '电子工程', '班级': '1102003'},
    {'id': 11020030002, '姓名': '孔静香', '性别': '女', '专业': '电子工程', '班级': '1102003'},
    {'id': 11030010001, '姓名': '赵 竣', '性别': '男', '专业': '计算机', '班级': '1103001'},
    {'id': 11030010002, '姓名': '庞 燕', '性别': '男', '专业': '计算机', '班级': '1103001'},
    {'id': 11030010003, '姓名': '毛安聚', '性别': '男', '专业': '计算机', '班级': '1103001'},
    {'id': 11030020001, '姓名': '邓飘雨', '性别': '男', '专业': '计算机', '班级': '1103002'},
    {'id': 11030020002, '姓名': '邹 爽', '性别': '女', '专业': '计算机', '班级': '1103002'},
    {'id': 11030020003, '姓名': '龚元才', '性别': '男', '专业': '计算机', '班级': '1103002'},
    {'id': 11030030001, '姓名': '寇瑞生', '性别': '男', '专业': '计算机', '班级': '1103003'},
    {'id': 11030030002, '姓名': '马庆炳', '性别': '男', '专业': '计算机', '班级': '1103003'},
    {'id': 11040010001, '姓名': '宋安璨', '性别': '女', '专业': '机电工程', '班级': '1104001'},
    {'id': 11040010002, '姓名': '宋牡妍', '性别': '女', '专业': '机电工程', '班级': '1104001'},
    {'id': 11040020001, '姓名': '刘恩帝', '性别': '男', '专业': '机电工程', '班级': '1104002'},
    {'id': 11040020002, '姓名': '杨 麟', '性别': '男', '专业': '机电工程', '班级': '1104002'},
    {'id': 11040030001, '姓名': '万 兵', '性别': '男', '专业': '机电工程', '班级': '1104003'},
    {'id': 11050010001, '姓名': '吕维蓝', '性别': '男', '专业': '物理与光电', '班级': '1105001'},
    {'id': 11050010002, '姓名': '封腾麟', '性别': '男', '专业': '物理与光电', '班级': '1105001'},
    {'id': 11050020001, '姓名': '方旭红', '性别': '女', '专业': '物理与光电', '班级': '1105002'},
    {'id': 11050020002, '姓名': '丁 芷', '性别': '男', '专业': '物理与光电', '班级': '1105002'},
    {'id': 11050030001, '姓名': '杨萍丽', '性别': '男', '专业': '物理与光电', '班级': '1105003'},
    {'id': 11060010001, '姓名': '郑富蔓', '性别': '男', '专业': '数学与统计', '班级': '1106001'},
    {'id': 11060010002, '姓名': '郭文兴', '性别': '男', '专业': '数学与统计', '班级': '1106001'},
    {'id': 11060020001, '姓名': '徐静玉', '性别': '女', '专业': '数学与统计', '班级': '1106002'},
    {'id': 11060020002, '姓名': '江开璨', '性别': '男', '专业': '数学与统计', '班级': '1106002'},
    {'id': 11060030001, '姓名': '何发升', '性别': '男', '专业': '数学与统计', '班级': '1106003'},
    {'id': 11070010001, '姓名': '成华 ', '性别': '男', '专业': '软件学院', '班级': '1107001'},
    {'id': 11070010002, '姓名': '伍 千', '性别': '男', '专业': '软件学院', '班级': '1107001'},
    {'id': 11070010003, '姓名': '程汝蓉', '性别': '女', '专业': '软件学院', '班级': '1107001'},
    {'id': 11080010001, '姓名': '侯求武', '性别': '男', '专业': '人文学院', '班级': '1108001'},
    {'id': 11080010002, '姓名': '韩敬良', '性别': '男', '专业': '人文学院', '班级': '1108001'},
    {'id': 11080010003, '姓名': '吕彦眉', '性别': '男', '专业': '人文学院', '班级': '1108001'},
    {'id': 11080020001, '姓名': '熊 毅', '性别': '男', '专业': '人文学院', '班级': '1108002'},
    {'id': 11090010001, '姓名': '汪平卿', '性别': '男', '专业': '外国语', '班级': '1109001'},
    {'id': 11090010002, '姓名': '何孝荃', '性别': '女', '专业': '外国语', '班级': '1109001'},
    {'id': 11090020001, '姓名': '任固夫', '性别': '男', '专业': '外国语', '班级': '1109002'},
    {'id': 11090020002, '姓名': '鲁均明', '性别': '男', '专业': '外国语', '班级': '1109002'},




]

mongodb.xj.insert_many(data)

for y in range(2):
    print(2)

a=re.search(r'href="/(\d+)/info',r'<a href="/1663983930/info">资料</a>')
artsumpattern = re.compile(r'>微博\[(\d+)\]<')
followspattern = re.compile(r'>关注\[(\d+)\]<')
fanspattern = re.compile(r'>粉丝\[(\d+)\]<')
addresspattern = re.compile(r'粉丝\d+人&nbsp;(.*?)<')
'''
f=open('F:/Documents/3.html','r', encoding='utf-8',errors='ignore')
data=f.read()
page=pq(data)
user=page('table td:eq(1) a:first')
for i in range(5):
    print(useruser.eq(i).text())
m=5
data=urllib.request.urlopen('http://www.maeda-atsuko.cn/index.php')
#print(data.read().decode('gbk'))
print(type(data))
a=data.read()
print(len(a))
print(len(a.decode('gbk')))

print(type(data))
💕-97年水瓶座的敏蜀黍康猴猴🙉🎀爱画画的蜀黍➕V：piaocanmin...
print('成功保存%s个用户信息'% m )



x=page('table td:eq(1)').text()
x = x.split()



n=addresspattern.search(data)
x=n.group(1)
print(x)

begin=n.end()
print(begin)

n=addresspattern.search(data,begin)

x=n.group(1)
print(x)

begin=n.end()
print(begin)

n=addresspattern.search(data,begin)
x=n.group(1)
print(x)

artsum=artsumpattern.search(data).group(1)

follows=followspattern.search(data).group(1)
fans=fanspattern.search(data).group(1)
print(artsum,follows,fans)
uid=idpattern.search(data).group(1)
print(uid)
y=page('.ut .ctt:eq(1)').text()
print(y)
x=page('.u [alt="V"]')
print(x)

print(a.groups())
print(a.group(0))
print(a.group(1))
'''